app/Controllers/Penjualan.php

    public function list()
    {
        if(!session()->logged_in) {
            return redirect()->to(base_url('user/login'));
        }

        $db      = \Config\Database::connect();
        $builder = $db->table('tbl_penjualan');
        $builder->select('tbl_penjualan.*, tbl_user.nama');
        $builder->where('tbl_penjualan.is_deleted', 0);
        $builder->join('tbl_user', 'tbl_penjualan.dibuat_oleh = tbl_user.user_id');
        $builder->orderBy('tbl_penjualan.tgl_dibuat', 'desc');
        $builder->limit(500);
        $penjualan_data   = $builder->get();
---
SELECT `tbl_penjualan`.*, `tbl_user`.`nama`
FROM `tbl_penjualan`
JOIN `tbl_user` ON `tbl_penjualan`.`dibuat_oleh` = `tbl_user`.`user_id`
WHERE `tbl_penjualan`.`is_deleted` = 0
ORDER BY `tbl_penjualan`.`tgl_dibuat` DESC