app/Controllers/PenjualanApi.php

SELECT `p`.*, `u`.`nama`
FROM `tbl_penjualan` `p`
JOIN `tbl_user` `u` ON `u`.`user_id` = `p`.`dibuat_oleh`
WHERE `p`.`is_deleted` = 0
AND DATE(p.tgl_dibuat) = '2025-01-25'
ORDER BY `p`.`tgl_dibuat` DESC
---
    public function getAllPenjualan($user_token, $date_filter) {
        $response = array(
            'status' => 404,
            'data' => []
        );

        $api_model = new UserApiLoginModel();
        if($api_model->isTokenValid($user_token)) {
            $date_filter = $date_filter == '1' ? date('Y-m-d') : date('Y-m-d', strtotime($date_filter));

            $model = new PenjualanModel();
            // $data = $model->where('is_deleted', 0)
            //                 ->where('DATE(tgl_dibuat)', $date_filter)
            //                 ->orderBy('tgl_dibuat', 'desc')->findAll();

            $db      = \Config\Database::connect();
            $builder = $db->table('tbl_penjualan p');
            $builder->select('p.*, u.nama');
            $builder->where('p.is_deleted', 0);
            $builder->where('DATE(p.tgl_dibuat)', $date_filter);
            $builder->join('tbl_user u', 'u.user_id = p.dibuat_oleh');
            $builder->orderBy('p.tgl_dibuat', 'desc');
            $query   = $builder->get();

SELECT *
FROM `tbl_setting`
---
    public function getProdukRekomendasi($user_token) {
        $data = $this->request->getVar('dataBelanja');
        $data = json_decode($data);
        $list_belanja = [];

        $response = array(
            'status' => 404,
            'data_rekomendasi' => []
        );

        $api_model = new UserApiLoginModel();
        if($api_model->isTokenValid($user_token)) {
            $support = 0.5;
            $confidence = 0.5;

            $setting_model = new SettingModel();
            $setting_data = $setting_model->findAll();