app/Controllers/ProdukApi.php

   	public function getAllProduk($user_token, $keyword) {
        $response = array(
            'status' => 404,
            'data' => []
        );

        $api_model = new UserApiLoginModel();
        if($api_model->isTokenValid($user_token)) {
            $db      = \Config\Database::connect();
            $db->query("SET SESSION sql_mode = 'STRICT_TRANS_TABLES,NO_ZERO_IN_DATE,NO_ZERO_DATE,ERROR_FOR_DIVISION_BY_ZERO,NO_ENGINE_SUBSTITUTION'");

            $builder = $db->table('tbl_produk p');
            $builder->select('p.produk_id, UPPER(p.nama_produk) as nama_produk, p.satuan_terkecil, p.netto, p.stok_min, p.satuan_terbesar, p.remarks');
            // $builder->selectSum('s.stok', 'total_stok');
            $builder->where('p.is_deleted', 0);
            // $builder->where('s.is_deleted', 0);
            // $builder->join('tbl_produk_stok s', 's.produk_id = p.produk_id');

            if($keyword != '') {
                $builder->like('p.nama_produk', $keyword, 'both');
            }

            $builder->orderBy('p.nama_produk');
            // $builder->groupBy('p.produk_id');
            $query   = $builder->get();
---
SELECT `p`.`produk_id`, UPPER(p.nama_produk) as nama_produk, `p`.`satuan_terkecil`, `p`.`netto`, `p`.`stok_min`, `p`.`satuan_terbesar`
FROM `tbl_produk` `p`
WHERE `p`.`is_deleted` = 0
AND  `p`.`nama_produk` LIKE '%cak%' ESCAPE '!'
ORDER BY `p`.`nama_produk`