app/Controllers/UserApi.php

    public function checkLogin($user_token) {
        $model = new UserApiLoginModel();
        $api_model = $model->where('user_token', $user_token)
                            ->where('status', 1)->first();
---
SELECT *
FROM `tbl_user_api_login`
WHERE `user_token` = 'd09bf41544a3365a46c9077ebb5e35c3'
AND `status` = 1
 LIMIT 1