app/Models/UserApiLoginModel.php

    public function isTokenValid($user_token) {
        $user_data = $this->where('user_token', $user_token)
                            ->where('status', 1)
                            ->first();
---
SELECT *
FROM `tbl_user_api_login`
WHERE `user_token` = '35f4a8d465e6e1edc05f3d8ab658c551'
AND `status` = 1
 LIMIT 1